       program-id. dummy as "dummy".

       environment division.
       configuration section.

       data division.
       working-storage section.

       procedure division.
           display "Hello World. I am a dummy project!".

           goback.

       end program dummy.
