       program-id. dummy as "dummy".

       environment division.
       configuration section.

       data division.
       working-storage section.

       procedure division.
           display "Hello There! This is a dummy project".
       
           goback.

       end program dummy.
